src/Enums/ОбъектыФинансовогоУчета/ОбъектыФинансовогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбъектыФинансовогоУчета</name>
  <enumValues>
    <name>ДенежныеСредстваВКассах</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваНаСчетах</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВПути</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеОтКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьКлиентов</name>
  </enumValues>
  <enumValues>
    <name>НДССАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>НДССАвансовВыданных</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеДолг</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеКомиссия</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеПроценты</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеДолг</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеКомиссия</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоЗаработнойПлате</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПодотчетнымиЛицами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоЗаймамСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>УслугиПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоАренде</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураОтгруженная</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяВПереработку</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаХранение</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>НДССПродаж</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаФинансовомРезультате</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>НДССПрочихДоходов</name>
  </enumValues>
  <enumValues>
    <name>ВходящийНДС</name>
  </enumValues>
  <enumValues>
    <name>РезервыОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>МатериалыИРаботыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПостатейныеЗатратыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВКассахККМ</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыручка</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ВнутрихозяйственныеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПоНеотфактурованнымПоставкам</name>
  </enumValues>
  <enumValues>
    <name>РезервПереоценкиСтоимостиОС</name>
  </enumValues>
  <enumValues>
    <name>РезервПереоценкиСтоимостиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередКомитентомПоРеализованнымТоварам</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередПринципаломПоРеализованнымУслугам</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередКомитентомПоЗакупкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоНалогамИВзносам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураВПути</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>АвансВыкупнойСтоимостиПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>НДСПоОтгрузкамБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ВнутрихозяйственныеРасчетыПоВыделенномуИмуществу</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСРозничнымиПокупателями</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоВзаимозачетамЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеДоходовОтПродолжающихсяОпераций</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеРасходовОтПродолжающихсяОпераций</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ПринятаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПереданнаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоВознаграждениям</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСтраховымВзносам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентныеРасходыДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеОС</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеНМА</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасов</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасовПереданных</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасовВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>БилетыИБронирование</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажБезНДС</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыручкаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаСубкомиссию</name>
  </enumValues>
  <enumValues>
    <name>СлужебныйНесобственныеЦенности</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуПереданнаяПартнерам</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуКСписанию</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеПереданнаяПартнерам</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеКСписанию</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыДисконтированияРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПереданныеОС</name>
  </enumValues>
  <enumValues>
    <name>АрендныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>НегарантированнаяЛиквидационнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыДисконтированияАрендныхПлатежей</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/МеждународныйУчетПоДаннымФинансовыхРегистровЛокализация/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Дополняет соответствие объектов финансового учета и источников их данных - имен балансовых регистров накопления.
// Параметры:
//  ИсточникиДанныхОбъектовУчета - см. Перечисления.ОбъектыФинансовогоУчета.ИсточникиДанныхОбъектовФинансовогоУчета
//
Процедура ДополнитьИсточникиДанныхОбъектовФинансовогоУчета(ИсточникиДанныхОбъектовУчета) Экспорт
	
	//++ Локализация
	
	ОбъектыФинансовогоУчета = Перечисления.ОбъектыФинансовогоУчета;
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.ДенежныеДокументы, РегистрыНакопленияМетаданные.ДенежныеДокументы.Имя);
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.РезервыПоВознаграждениям, РегистрыНакопленияМетаданные.ДвиженияПоПрочимАктивамПассивам.Имя);
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам, РегистрыНакопленияМетаданные.ДвиженияПоПрочимАктивамПассивам.Имя);
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет записи в таблицу описания объектов финансового учета.
// 
// Параметры:
// 	ОбъектыФинансовогоУчета - см.Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектовФинансовогоУчета
// 	НастройкиПроводок - см. Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок
// 
Процедура ДополнитьОписаниеОбъектовФинансовогоУчета(ОбъектыФинансовогоУчета, НастройкиПроводок) Экспорт
	
	//++ Локализация
	
	СтрокаДенежныеДокументы = ОбъектыФинансовогоУчета.Добавить();
	СтрокаДенежныеДокументы.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.ДенежныеДокументы;
	СтрокаДенежныеДокументы.ФункциональныеОпции = Метаданные.ФункциональныеОпции.ИспользоватьРеглУчет.Имя;
	
	СтрокаРезервыПоВознаграждениям = ОбъектыФинансовогоУчета.Добавить();
	СтрокаРезервыПоВознаграждениям.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.РезервыПоВознаграждениям;
	ФункциональныеОпции = Новый Массив();
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРезервыПоОплатеТруда.Имя);
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоВознаграждениям.ФункциональныеОпции = ФункциональныеОпции;
	СтрокаРезервыПоВознаграждениям.ПутьКДаннымОбъектНастройки = "Аналитика";
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоВознаграждениям);
	СтрокаРезервыПоВознаграждениям.ОтборДанных = ОтборДанных;
	
	СтрокаРезервыПоСтраховымВзносам = ОбъектыФинансовогоУчета.Добавить();
	СтрокаРезервыПоСтраховымВзносам.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам;
	ФункциональныеОпции = Новый Массив();
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРезервыПоОплатеТруда.Имя);
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоСтраховымВзносам.ФункциональныеОпции = ФункциональныеОпции;
	СтрокаРезервыПоСтраховымВзносам.ПутьКДаннымОбъектНастройки = "Аналитика";
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоСтраховымВзносам);
	СтрокаРезервыПоСтраховымВзносам.ОтборДанных = ОтборДанных;
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет элементы в соответствие расширенного описания объектов финансового учета.
// 
// Параметры:
//  ОписаниеОбъектовУчетаДляНастройкиФорм - Соответствие Из КлючИЗначение - данные расширенного описания объектов финансового учета:
//  	* Ключ - ПеречислениеСсылка.ОбъектыФинансовогоУчета - объект финансового учета
//  	* Значение - см. Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм
//  ГруппыОбъектовУчета - см. Перечисления.ОбъектыФинансовогоУчета.ГруппыОбъектовУчета
//  НастройкиПроводок - см. Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок
//
Процедура ДополнитьРасширенноеОписаниеОбъектовУчетаДляНастройки(
	ОписаниеОбъектовУчетаДляНастройкиФорм, ГруппыОбъектовУчета, НастройкиПроводок) Экспорт
	
	//++ Локализация
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.ДережныеСредства;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'В денежных документах';
												|en = 'In financial documents'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета денежных документов';
																|en = 'Ledger accounts of financial documents'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Неопределено;
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.ДенежныеДокументы, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.РезервыПоОплатеТруда;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по вознаграждениям';
												|en = 'Remuneration provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по вознаграждениям';
																|en = 'GL accounts of provisions for remunerations'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Новый ОписаниеТипов("СправочникСсылка.Резервы");
	ОписаниеОбъектаУчета.ОтборОбъектовНастройки = Новый Структура(
		Метаданные.Справочники.Резервы.Реквизиты.ТипРезерва.Имя,
		Перечисления.ТипыРезервовПредстоящихРасходов.ОплатаТруда);
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.РезервыПоВознаграждениям, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.РезервыПоОплатеТруда;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по страховым взносам';
												|en = 'Insurance contribution provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по страховым взносам';
																|en = 'GL accounts of provisions for insurance contributions'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Новый ОписаниеТипов("СправочникСсылка.Резервы");
	ОписаниеОбъектаУчета.ОтборОбъектовНастройки = Новый Структура(
		Метаданные.Справочники.Резервы.Реквизиты.ТипРезерва.Имя,
		Перечисления.ТипыРезервовПредстоящихРасходов.ОплатаТруда);
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам, ОписаниеОбъектаУчета);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
